       01 CONTARSTR-VARIABLES-DE-TRABAJO.
           05 I                 PIC 9(05).
           05 SALIR             PIC X.
           05 WS-LARGO-STR-REV  PIC 9(05).
           05 WS-LARGO-STR-BUS  PIC 9(05).

       01 INPUT-LARGOSTR10000.
           05 STRING-CALCULAR   PIC X(10000).
       01 OUTPUT-LARGOSTR10000.
           05 LK-LARGO-STR     PIC 9(05).
