       01  usuario-registro.
           05  usuario-rut        PIC 9(10).
		   05  usuario-dv         PIC X.
           05  usuario-nombre     PIC X(30).
		   05  usuario-apepat     PIC X(30).
		   05  usuario-apemat     PIC X(30).
		   05  usuario-fecnac     PIC 9(08).
		   05  usuario-genero     PIC X.
           05  usuario-direccion  PIC X(50).
		   05  usuario-ciudad     PIC X(50).
		   05  usuario-telefono1  PIC X(15).
		   05  usuario-telefono2  PIC X(15).
		   05  usuario-email      PIC X(100).
		   05  usuario-feccre     PIC 9(08).
		   