             CMD        PROMPT('IMPRIME DDS ARCHIVO       ')

             PARM       KWD(BIB)  TYPE(*CHAR) LEN(10) MIN(1) +
                          PROMPT('Biblioteca')
             PARM       KWD(PGM)  TYPE(*CHAR) LEN(10) MIN(1) +
                          PROMPT('Archivo ')
