             PGM

             DCL VAR(&USUARIO) TYPE(*CHAR) LEN(10)
             RTVJOBA    USER(&USUARIO)

             CALL PGM(ASQRY23) PARM(&USUARIO)

 FIN:        ENDPGM
