     PGM        PARM(&CONS &FPRO &HPRO &SEC &ABAS &BBAS +
                     &AGEN &USR &STOPE &REFABAS &REFAGEN +
                     &REFBGEN &REEARC &RETJOB &ADDREG &REGUNI +
                     &ARCHIVO &BIBLIOT)
     DCL VAR(&CONS)    TYPE(*CHAR) LEN(10)
     DCL VAR(&FPRO)    TYPE(*CHAR) LEN(08)
     DCL VAR(&HPRO)    TYPE(*CHAR) LEN(06)
     DCL VAR(&SEC)     TYPE(*CHAR) LEN(05)
     DCL VAR(&ABAS)    TYPE(*CHAR) LEN(10)
     DCL VAR(&BBAS)    TYPE(*CHAR) LEN(10)
     DCL VAR(&AGEN)    TYPE(*CHAR) LEN(10)
     DCL VAR(&USR)     TYPE(*CHAR) LEN(10)
     DCL VAR(&STOPE)   TYPE(*CHAR) LEN(05)
     DCL VAR(&REFABAS) TYPE(*CHAR) LEN(10)
     DCL VAR(&REFAGEN) TYPE(*CHAR) LEN(10)
     DCL VAR(&REFBGEN) TYPE(*CHAR) LEN(10)
     DCL VAR(&REEARC)  TYPE(*CHAR) LEN(01)
     DCL VAR(&RETJOB)  TYPE(*CHAR) LEN(01)
     DCL VAR(&ADDREG)  TYPE(*CHAR) LEN(01)
     DCL VAR(&REGUNI)  TYPE(*CHAR) LEN(01)
     DCL VAR(&TEXTO)   TYPE(*CHAR) LEN(50)
     DCL VAR(&SEC1)    TYPE(*CHAR) LEN(05)
     DCL VAR(&ARCHIVO) TYPE(*CHAR) LEN(10)
     DCL VAR(&BIBLIOT) TYPE(*CHAR) LEN(10)

     ADDLIBLE LIB(GXCPSCA) POSITION(*LAST)
     MONMSG MSGID(CPF0000)
     ADDLIBLE LIB(GXDBSCA) POSITION(*LAST)
     MONMSG MSGID(CPF0000)
     ADDLIBLE LIB(ALMALIB) POSITION(*LAST)
     MONMSG MSGID(CPF0000)
     MONMSG MSGID(CPF0000)
     ADDLIBLE LIB(SIP2PRU3) POSITION(*LAST)
     MONMSG MSGID(CPF0000)
     ADDLIBLE LIB(GXCPSRV) POSITION(*LAST)
     MONMSG MSGID(CPF0000)
     ADDLIBLE LIB(GXDBSRV) POSITION(*LAST)
     MONMSG MSGID(CPF0000)
INICIO:
     IF   COND((&REFABAS *NE ' ') *AND (&REFAGEN *NE ' +
                          ')) THEN(DO)
          OVRDBF     FILE(&REFABAS) TOFILE(&REFBGEN/&REFAGEN) +
                     MBR(*FIRST) SHARE(*YES) SEQONLY(*YES)
     ENDDO
     RTVOBJD OBJ(&BBAS/&AGEN) OBJTYPE(*FILE) TEXT(&TEXTO)
     MONMSG MSGID(CPF0000) EXEC(GOTO CMDLBL(CREAR))
     IF COND(&ADDREG *EQ 'N') THEN(DO)
        DLTF FILE(&BBAS/&AGEN)
        MONMSG MSGID(CPF3202) EXEC(GOTO CMDLBL(BLOQUEO))
        CPYF   FROMFILE(&BBAS/&ABAS) TOFILE(&BBAS/&AGEN) +
               MBROPT(*ADD) CRTFILE(*YES)
        CLRPFM FILE(&BBAS/&AGEN)
      ENDDO
      GOTO CMDLBL(LLAMA)
 BLOQUEO:
      CALL   PGM(ASQRY20) PARM(&CONS &FPRO &HPRO &SEC +
             &STOPE &USR &ADDREG &REGUNI)
      GOTO CMDLBL(FIN)
 CREAR:
      CPYF  FROMFILE(&BBAS/&ABAS) TOFILE(&BBAS/&AGEN) +
            MBROPT(*ADD) CRTFILE(*YES)
      CLRPFM FILE(&BBAS/&AGEN)
      GOTO CMDLBL(LLAMA)
 LLAMA:
      CHGVAR VAR(&SEC1) VALUE(&SEC)
      CPYF   FROMFILE(&BIBLIOT/&ARCHIVO) +
             TOFILE(&BBAS/&AGEN) MBROPT(*ADD) +
             FMTOPT(*MAP *DROP)
      MONMSG MSGID(CPF0000)
      CALL  PGM(GXCPSMI/SNDFTPSBM) PARM(&AGEN &CONS +
            &FPRO &HPRO &SEC1 &USR)

      CALL  PGM(ASQRY46) PARM(&CONS &FPRO &HPRO &SEC1 +
            &STOPE &USR &ADDREG &REGUNI)
FIN:
     ENDPGM
