             PGM        PARM(&DMA &AMD)
             DCL VAR(&AMD)    TYPE(*CHAR) LEN(08)
             DCL VAR(&DMA)    TYPE(*CHAR) LEN(08)
             DCL VAR(&FECSYS) TYPE(*CHAR) LEN(06)

             RTVSYSVAL  SYSVAL(QDATE) RTNVAR(&FECSYS)
             CVTDAT     DATE(&DMA)    TOVAR(&AMD) FROMFMT(*DMYY) +
                          TOFMT(*YYMD) TOSEP(*NONE)
             MONMSG     MSGID(CPF0000) EXEC(CHGVAR VAR(&AMD) VALUE(' +
                          '))
             ENDPGM
