     A                                      UNIQUE
     A          R RASQRY04F
     A*
     A            CODEVE        10A         TEXT('CODIGO EVENTO ')
     A            COREVE         5S 0       TEXT('CORRELATIVO EVENTO')
     A            NROPRO         5S 0       TEXT('NUMERO PROCESO')
     A            CORPRO         5S 0       TEXT('CORRELATIVO PROCESO')
     A            USRPRO        10A         TEXT('USUARIO PROCESO     ')
     A            FECPRO1        8S 0       TEXT('FECHA PROCESO INICIO')
     A            HORPRO1        6S 0       TEXT('HORA  PROCESO INICIO')
     A            FECPRO2        8S 0       TEXT('FECHA PROCESO FIN   ')
     A            HORPRO2        6S 0       TEXT('HORA  PROCESO FIN   ')
     A            ARCRUT        10A         TEXT('ARCHIVO RUT A USAR  ')
     A            BIBRUT        10A         TEXT('BIB. RUT A USAR     ')
     A            CANREG         8S 0       TEXT('CANTIDAD REGISTROS  ')
     A            ARCBAS        10A         TEXT('ARCHIVO BASE        ')
     A            BIBBAS        10A         TEXT('BIBLIOTECA BASE     ')
     A            ARCGEN        10A         TEXT('ARCHIVO GENERADO    ')
     A            BIBGEN        10A         TEXT('BIBLIOTECA GENERADO ')
     A            ESTPRO         1A         TEXT('ESTADO PROCESO      ')
     A            SECEJE         5S 0       TEXT('SECUENCIA EJECUCION')
     A            LARSEL         5S 0       TEXT('Largo Seleccion    ')
     A            REEARC         1A         TEXT('Reemplazar Archivo')
     A            RETJOB         1A         TEXT('Retener Trabajo   ')
     A            ADDREG         1A         TEXT('A±adir Registros  ')
     A            REGUNI         1A         TEXT('SelecciÍn Distinct')
     A            SELEJE     10000A         TEXT('SELECCION A EJECUTAR')
     A            SELCON     10000A         TEXT('SELECCION CONVERTIDA')
     A            MIEMBR      4000A         TEXT('ARC/ARC USAR/BIB/MBR')
     A*
     A* ESTPRO P=EN PROCESO
     A*        T=TERMINADO
     A*        D=DEPURADO
     A*
     A          K CODEVE
     A          K FECPRO1
     A          K HORPRO1
     A          K SECEJE
