    PGM PARM(&ARCHIVO &BIBLIOTECA)
        DCL VAR(&ARCHIVO)    TYPE(*CHAR) LEN(10)
        DCL VAR(&BIBLIOTECA) TYPE(*CHAR) LEN(10)

        DLTF    FILE(&BIBLIOTECA/&ARCHIVO)
        MONMSG  MSGID(CPF0000)

    ENDPGM
