    PGM PARM(&ARCHIVO)
         DCL VAR(&ARCHIVO)  TYPE(*CHAR) LEN(50)
         DCL VAR(&IDFTP)    TYPE(*CHAR) LEN(10) VALUE('SELMULINF ')
         DCL VAR(&IPFTP)    TYPE(*CHAR) LEN(20)

         DLTF       FILE(QTEMP/ARCFTP)
         MONMSG     MSGID(CPF0000)

         DLTF       FILE(QTEMP/LOGFTP)
         MONMSG     MSGID(CPF0000)

         CRTDUPOBJ  OBJ(ARCFTP) FROMLIB(*LIBL) OBJTYPE(*FILE) +
                   TOLIB(QTEMP) DATA(*NO)
         MONMSG     MSGID(CPF0000)

         CRTDUPOBJ  OBJ(ARCFTP) FROMLIB(LOGFTP) OBJTYPE(*FILE) +
                         TOLIB(QTEMP) DATA(*NO)
         MONMSG     MSGID(CPF0000)

         OVRDBF     FILE(ARCFTP) TOFILE(QTEMP/ARCFTP)
         CALL PGM(DLTFTP) PARM(&IDFTP &ARCHIVO &IPFTP)

         OVRDBF FILE(INPUT) TOFILE(QTEMP/ARCFTP)
         OVRDBF FILE(OUTPUT) TOFILE(QTEMP/LOGFTP)

         FTP RMTSYS(&IPFTP)

    FIN: DLTOVR *ALL
         ENDPGM
